{
  "format": "layers-model",
  "generatedBy": "TensorFlow.js tfjs-layers v4.22.0",
  "convertedBy": null,
  "modelTopology": {
    "class_name": "Sequential",
    "config": {
      "name": "rasa_tiny_embedder",
      "layers": [
        {
          "class_name": "Embedding",
          "config": {
            "input_dim": 64,
            "output_dim": 6,
            "embeddings_initializer": {
              "class_name": "RandomUniform",
              "config": {
                "minval": -0.05,
                "maxval": 0.05,
                "seed": null
              }
            },
            "embeddings_regularizer": null,
            "activity_regularizer": null,
            "embeddings_constraint": null,
            "mask_zero": null,
            "input_length": 8,
            "name": "token_embedding",
            "trainable": true,
            "batch_input_shape": [
              null,
              8
            ]
          }
        },
        {
          "class_name": "Flatten",
          "config": {
            "name": "flatten_tokens",
            "trainable": true
          }
        },
        {
          "class_name": "Dense",
          "config": {
            "units": 12,
            "activation": "relu",
            "use_bias": true,
            "kernel_initializer": {
              "class_name": "VarianceScaling",
              "config": {
                "scale": 1,
                "mode": "fan_avg",
                "distribution": "normal",
                "seed": null
              }
            },
            "bias_initializer": {
              "class_name": "Zeros",
              "config": {}
            },
            "kernel_regularizer": null,
            "bias_regularizer": null,
            "activity_regularizer": null,
            "kernel_constraint": null,
            "bias_constraint": null,
            "name": "embedding_projection",
            "trainable": true
          }
        },
        {
          "class_name": "Dense",
          "config": {
            "units": 5,
            "activation": "linear",
            "use_bias": true,
            "kernel_initializer": {
              "class_name": "VarianceScaling",
              "config": {
                "scale": 1,
                "mode": "fan_avg",
                "distribution": "normal",
                "seed": null
              }
            },
            "bias_initializer": {
              "class_name": "Zeros",
              "config": {}
            },
            "kernel_regularizer": null,
            "bias_regularizer": null,
            "activity_regularizer": null,
            "kernel_constraint": null,
            "bias_constraint": null,
            "name": "token_logits",
            "trainable": true
          }
        }
      ]
    },
    "keras_version": "tfjs-layers 4.22.0",
    "backend": "tensor_flow.js"
  },
  "weightsManifest": [
    {
      "paths": [
        "group1-shard1of1.bin"
      ],
      "weights": [
        {
          "name": "token_embedding/embeddings",
          "shape": [
            64,
            6
          ],
          "dtype": "float32"
        },
        {
          "name": "embedding_projection/kernel",
          "shape": [
            48,
            12
          ],
          "dtype": "float32"
        },
        {
          "name": "embedding_projection/bias",
          "shape": [
            12
          ],
          "dtype": "float32"
        },
        {
          "name": "token_logits/kernel",
          "shape": [
            12,
            5
          ],
          "dtype": "float32"
        },
        {
          "name": "token_logits/bias",
          "shape": [
            5
          ],
          "dtype": "float32"
        }
      ]
    }
  ]
}
