{
  "format": "layers-model",
  "generatedBy": "TensorFlow.js tfjs-layers v4.22.0",
  "convertedBy": null,
  "modelTopology": {
    "class_name": "Sequential",
    "config": {
      "name": "rasa_tiny_autoencoder",
      "layers": [
        {
          "class_name": "Dense",
          "config": {
            "units": 8,
            "activation": "relu",
            "use_bias": true,
            "kernel_initializer": {
              "class_name": "VarianceScaling",
              "config": {
                "scale": 1,
                "mode": "fan_avg",
                "distribution": "normal",
                "seed": null
              }
            },
            "bias_initializer": {
              "class_name": "Zeros",
              "config": {}
            },
            "kernel_regularizer": null,
            "bias_regularizer": null,
            "activity_regularizer": null,
            "kernel_constraint": null,
            "bias_constraint": null,
            "name": "encoder_dense",
            "trainable": true,
            "batch_input_shape": [
              null,
              16
            ],
            "dtype": "float32"
          }
        },
        {
          "class_name": "Dense",
          "config": {
            "units": 4,
            "activation": "relu",
            "use_bias": true,
            "kernel_initializer": {
              "class_name": "VarianceScaling",
              "config": {
                "scale": 1,
                "mode": "fan_avg",
                "distribution": "normal",
                "seed": null
              }
            },
            "bias_initializer": {
              "class_name": "Zeros",
              "config": {}
            },
            "kernel_regularizer": null,
            "bias_regularizer": null,
            "activity_regularizer": null,
            "kernel_constraint": null,
            "bias_constraint": null,
            "name": "bottleneck",
            "trainable": true
          }
        },
        {
          "class_name": "Dense",
          "config": {
            "units": 8,
            "activation": "relu",
            "use_bias": true,
            "kernel_initializer": {
              "class_name": "VarianceScaling",
              "config": {
                "scale": 1,
                "mode": "fan_avg",
                "distribution": "normal",
                "seed": null
              }
            },
            "bias_initializer": {
              "class_name": "Zeros",
              "config": {}
            },
            "kernel_regularizer": null,
            "bias_regularizer": null,
            "activity_regularizer": null,
            "kernel_constraint": null,
            "bias_constraint": null,
            "name": "decoder_dense",
            "trainable": true
          }
        },
        {
          "class_name": "Dense",
          "config": {
            "units": 16,
            "activation": "linear",
            "use_bias": true,
            "kernel_initializer": {
              "class_name": "VarianceScaling",
              "config": {
                "scale": 1,
                "mode": "fan_avg",
                "distribution": "normal",
                "seed": null
              }
            },
            "bias_initializer": {
              "class_name": "Zeros",
              "config": {}
            },
            "kernel_regularizer": null,
            "bias_regularizer": null,
            "activity_regularizer": null,
            "kernel_constraint": null,
            "bias_constraint": null,
            "name": "reconstruction",
            "trainable": true
          }
        }
      ]
    },
    "keras_version": "tfjs-layers 4.22.0",
    "backend": "tensor_flow.js"
  },
  "weightsManifest": [
    {
      "paths": [
        "group1-shard1of1.bin"
      ],
      "weights": [
        {
          "name": "encoder_dense/kernel",
          "shape": [
            16,
            8
          ],
          "dtype": "float32"
        },
        {
          "name": "encoder_dense/bias",
          "shape": [
            8
          ],
          "dtype": "float32"
        },
        {
          "name": "bottleneck/kernel",
          "shape": [
            8,
            4
          ],
          "dtype": "float32"
        },
        {
          "name": "bottleneck/bias",
          "shape": [
            4
          ],
          "dtype": "float32"
        },
        {
          "name": "decoder_dense/kernel",
          "shape": [
            4,
            8
          ],
          "dtype": "float32"
        },
        {
          "name": "decoder_dense/bias",
          "shape": [
            8
          ],
          "dtype": "float32"
        },
        {
          "name": "reconstruction/kernel",
          "shape": [
            8,
            16
          ],
          "dtype": "float32"
        },
        {
          "name": "reconstruction/bias",
          "shape": [
            16
          ],
          "dtype": "float32"
        }
      ]
    }
  ]
}
