{
  "format": "layers-model",
  "generatedBy": "TensorFlow.js tfjs-layers v4.22.0",
  "convertedBy": null,
  "modelTopology": {
    "class_name": "Sequential",
    "config": {
      "name": "rasa_tiny_mlp",
      "layers": [
        {
          "class_name": "Dense",
          "config": {
            "units": 24,
            "activation": "relu",
            "use_bias": true,
            "kernel_initializer": {
              "class_name": "VarianceScaling",
              "config": {
                "scale": 1,
                "mode": "fan_avg",
                "distribution": "normal",
                "seed": null
              }
            },
            "bias_initializer": {
              "class_name": "Zeros",
              "config": {}
            },
            "kernel_regularizer": null,
            "bias_regularizer": null,
            "activity_regularizer": null,
            "kernel_constraint": null,
            "bias_constraint": null,
            "name": "feature_projection",
            "trainable": true,
            "batch_input_shape": [
              null,
              32
            ],
            "dtype": "float32"
          }
        },
        {
          "class_name": "Dense",
          "config": {
            "units": 12,
            "activation": "relu",
            "use_bias": true,
            "kernel_initializer": {
              "class_name": "VarianceScaling",
              "config": {
                "scale": 1,
                "mode": "fan_avg",
                "distribution": "normal",
                "seed": null
              }
            },
            "bias_initializer": {
              "class_name": "Zeros",
              "config": {}
            },
            "kernel_regularizer": null,
            "bias_regularizer": null,
            "activity_regularizer": null,
            "kernel_constraint": null,
            "bias_constraint": null,
            "name": "hidden_dense",
            "trainable": true
          }
        },
        {
          "class_name": "Dense",
          "config": {
            "units": 4,
            "activation": "linear",
            "use_bias": true,
            "kernel_initializer": {
              "class_name": "VarianceScaling",
              "config": {
                "scale": 1,
                "mode": "fan_avg",
                "distribution": "normal",
                "seed": null
              }
            },
            "bias_initializer": {
              "class_name": "Zeros",
              "config": {}
            },
            "kernel_regularizer": null,
            "bias_regularizer": null,
            "activity_regularizer": null,
            "kernel_constraint": null,
            "bias_constraint": null,
            "name": "class_scores",
            "trainable": true
          }
        }
      ]
    },
    "keras_version": "tfjs-layers 4.22.0",
    "backend": "tensor_flow.js"
  },
  "weightsManifest": [
    {
      "paths": [
        "group1-shard1of1.bin"
      ],
      "weights": [
        {
          "name": "feature_projection/kernel",
          "shape": [
            32,
            24
          ],
          "dtype": "float32"
        },
        {
          "name": "feature_projection/bias",
          "shape": [
            24
          ],
          "dtype": "float32"
        },
        {
          "name": "hidden_dense/kernel",
          "shape": [
            24,
            12
          ],
          "dtype": "float32"
        },
        {
          "name": "hidden_dense/bias",
          "shape": [
            12
          ],
          "dtype": "float32"
        },
        {
          "name": "class_scores/kernel",
          "shape": [
            12,
            4
          ],
          "dtype": "float32"
        },
        {
          "name": "class_scores/bias",
          "shape": [
            4
          ],
          "dtype": "float32"
        }
      ]
    }
  ]
}
